import React from "react"
import Text from "@/ui/Text"
import Button from "@/ui/Button"

import card from "@/public/images/landing/card.svg"
import arrow from "@/public/images/landing/card_arrow.svg"
const SecondSection = () => {
  const k = 4
  return (
    <section className="min-h-screen w-full flex flex-col ">
      <div className="w-full flex flex-grow">
        <div className="flex w-full flex-col flex-2">
          <Text text={"Интеллектуальная"} tag={"h2"}></Text>
          <Text text={"терминологическая"} tag={"h2"}></Text>

          <Text text={"база данных"} tag={"h2"}></Text>
        </div>

        <div className="flex flex-col max-w-[558px] gap-8 mt-5">
          <Text
            text={`Инструмент автоматически распознает и выделяет ключевые термины в
            тексте, предлагая наиболее подходящие переводы на основе контекста и
            ранее проверенных переводов`}
            tag={"p"}
          ></Text>

          <Button type={"primary-action"} text={"Узнать больше"}></Button>
        </div>
      </div>

      {/* cards */}

      <div className="w-full flex gap-2">
        {/* 1 */}

        <div className="relative w-1/4 flex">
          <svg xmlns={card} className="w-full fill-[#E8E8E8]">
            <path d="M280 24C280 10.7452 269.255 0 256 0H24C10.7452 0 0 10.7452 0 24V316C0 329.255 10.7452 340 24 340H197C210.255 340 221 329.255 221 316V314C221 295.775 235.775 281 254 281H256C269.255 281 280 270.255 280 257V24Z"></path>
          </svg>

          <svg
            xmlns={arrow}
            height={48}
            width={48}
            className="fill-red-500 absolute right-0 bottom-0"
          >
            <rect width="48" height="48" rx="24" />
            <path
              className="fill-black"
              d="M15.5661 31.5661C15.3318 31.8004 15.3318 32.1803 15.5661 32.4146C15.8004 32.6489 16.1803 32.6489 16.4146 32.4146L15.5661 31.5661ZM32.1467 16.434C32.1467 16.1026 31.8781 15.834 31.5467 15.834L26.1467 15.834C25.8153 15.834 25.5467 16.1026 25.5467 16.434C25.5467 16.7654 25.8153 17.034 26.1467 17.034L30.9467 17.034L30.9467 21.834C30.9467 22.1654 31.2153 22.434 31.5467 22.434C31.8781 22.434 32.1467 22.1654 32.1467 21.834L32.1467 16.434ZM16.4146 32.4146L31.971 16.8583L31.1224 16.0097L15.5661 31.5661L16.4146 32.4146Z"
            ></path>
          </svg>
        </div>

        {/* 2 */}

        <div className="relative w-1/4 flex">
          <svg
            xmlns={card}
            height={340}
            width={280}
            className="w-full fill-[#E8E8E8]"
          >
            <path d="M280 24C280 10.7452 269.255 0 256 0H24C10.7452 0 0 10.7452 0 24V316C0 329.255 10.7452 340 24 340H197C210.255 340 221 329.255 221 316V314C221 295.775 235.775 281 254 281H256C269.255 281 280 270.255 280 257V24Z"></path>
          </svg>

          <svg
            xmlns={arrow}
            height={48}
            width={48}
            className="fill-red-500 absolute right-0 bottom-0"
          >
            <rect width="48" height="48" rx="24" />
            <path
              className="fill-black"
              d="M15.5661 31.5661C15.3318 31.8004 15.3318 32.1803 15.5661 32.4146C15.8004 32.6489 16.1803 32.6489 16.4146 32.4146L15.5661 31.5661ZM32.1467 16.434C32.1467 16.1026 31.8781 15.834 31.5467 15.834L26.1467 15.834C25.8153 15.834 25.5467 16.1026 25.5467 16.434C25.5467 16.7654 25.8153 17.034 26.1467 17.034L30.9467 17.034L30.9467 21.834C30.9467 22.1654 31.2153 22.434 31.5467 22.434C31.8781 22.434 32.1467 22.1654 32.1467 21.834L32.1467 16.434ZM16.4146 32.4146L31.971 16.8583L31.1224 16.0097L15.5661 31.5661L16.4146 32.4146Z"
            ></path>
          </svg>
        </div>

        {/* 3 */}
        <div className="relative w-1/4 flex">
          <svg
            xmlns={card}
            height={340}
            width={280}
            className="w-full fill-[#E8E8E8]"
          >
            <path d="M280 24C280 10.7452 269.255 0 256 0H24C10.7452 0 0 10.7452 0 24V316C0 329.255 10.7452 340 24 340H197C210.255 340 221 329.255 221 316V314C221 295.775 235.775 281 254 281H256C269.255 281 280 270.255 280 257V24Z"></path>
          </svg>

          <svg
            xmlns={arrow}
            height={48}
            width={48}
            className="fill-red-500 absolute right-0 bottom-0"
          >
            <rect width="48" height="48" rx="24" />
            <path
              className="fill-black"
              d="M15.5661 31.5661C15.3318 31.8004 15.3318 32.1803 15.5661 32.4146C15.8004 32.6489 16.1803 32.6489 16.4146 32.4146L15.5661 31.5661ZM32.1467 16.434C32.1467 16.1026 31.8781 15.834 31.5467 15.834L26.1467 15.834C25.8153 15.834 25.5467 16.1026 25.5467 16.434C25.5467 16.7654 25.8153 17.034 26.1467 17.034L30.9467 17.034L30.9467 21.834C30.9467 22.1654 31.2153 22.434 31.5467 22.434C31.8781 22.434 32.1467 22.1654 32.1467 21.834L32.1467 16.434ZM16.4146 32.4146L31.971 16.8583L31.1224 16.0097L15.5661 31.5661L16.4146 32.4146Z"
            ></path>
          </svg>
        </div>

        {/* 4 */}

        <div className="relative w-1/4 flex">
          <svg
            xmlns={card}
            height={340}
            width={280}
            className="w-full fill-[#E8E8E8]"
          >
            <path d="M280 24C280 10.7452 269.255 0 256 0H24C10.7452 0 0 10.7452 0 24V316C0 329.255 10.7452 340 24 340H197C210.255 340 221 329.255 221 316V314C221 295.775 235.775 281 254 281H256C269.255 281 280 270.255 280 257V24Z"></path>
          </svg>

          <svg
            xmlns={arrow}
            height={48}
            width={48}
            className="fill-red-500 absolute right-0 bottom-0"
          >
            <rect width="48" height="48" rx="24" />
            <path
              className="fill-black"
              d="M15.5661 31.5661C15.3318 31.8004 15.3318 32.1803 15.5661 32.4146C15.8004 32.6489 16.1803 32.6489 16.4146 32.4146L15.5661 31.5661ZM32.1467 16.434C32.1467 16.1026 31.8781 15.834 31.5467 15.834L26.1467 15.834C25.8153 15.834 25.5467 16.1026 25.5467 16.434C25.5467 16.7654 25.8153 17.034 26.1467 17.034L30.9467 17.034L30.9467 21.834C30.9467 22.1654 31.2153 22.434 31.5467 22.434C31.8781 22.434 32.1467 22.1654 32.1467 21.834L32.1467 16.434ZM16.4146 32.4146L31.971 16.8583L31.1224 16.0097L15.5661 31.5661L16.4146 32.4146Z"
            ></path>
          </svg>
        </div>
      </div>
    </section>
  )
}

export default SecondSection
