export const steps = [
  {
    id: "01",
    title: "Учетная запись",
    text: "Создайте или войдите в свой аккаунт TermCAT"
  },
  {
    id: "02",
    title: "Подготовка к переводу",
    text: "Загрузите свой исходный текст или файл с текстом на английском языке во вкладке «перевод»"
  },
  {
    id: "03",
    title: "Работа нейросети",
    text: "Получите наиболее точные и контекстуальные результаты для любого типа текста"
  },
  {
    id: "04",
    title: "Работа нейросети",
    text: "Воспользуйтесь предложенными нейросетью терминами для дальнейшего перевода"
  }
]


export const feedbacks = [
  {
    name: "Екатерина Смирнова",
    status: "Специалист по переводам в области медицины, ЮФУ",
    text: "Перевод медицинских текстов требует особой точности и внимания к деталям. Работая с TermCAT инструментом, я уверена в точности переводов медицинской терминологии. Инструмент учитывает контекст и предлагает наиболее подходящие варианты, что значительно сокращает время на проверку и редактирование.",
  },
  {
    name: "Олег Шапов",
    status: "Студент МКиМТ, ДГТУ (специалист в цифровом контенте)",
    text: "Благодаря этому инструменту, перевод иностранного контента стал качественнее. Теперь мне  гораздо легче работать с зарубежными аналитическими данными, чтобы публиковать их в журналах. Я с уверенностью рекомендую TermCAT всем студентам!",
  },
  {
    name: "Андрей Лысов",
    status: "Лингвист-переводчик, фрилансер",
    text: "Как начинающему лингвисту, мне нужно было найти бюджетный, но эффективный инструмент для перевода, чтобы зарабатывать в интернете, занимаясь фрилансом, и именно тогда я наткнулся на TermCAT. С самого начала работы с TermCAT меня приятно удивила его простота и интуитивно понятный интерфейс.",
  },
  {
    name: "Виктория Лазаренко",
    status: "Лингвист-переводчик, фрилансер",
    text: "Я очень довольна, что оформила подписку на TermCAT, так как он учитывает контекст и предлагает наиболее точный и подходящий перевод, что позволяет мне избежать ошибок и не тратить время на поиск терминов в глоссариях. Так как мне проходится работать с текстами разных областей, TermCAT незаменимый инструмент для меня.",
  },
  {
    name: "Иван Торопыга",
    status: "Начинающий программист, фрилансер",
    text: "Недавно я осваивал новую профессию, мне было важно изучать IT на английском языке. Часто приходилось обращаться к онлайн-переводчику, но он не справлялся с контекстом. Благодаря TermCAT инструменту, мне удалось быстрее освоить новую профессию. Функция «память переводов» меня особенно выручала.",
  },
  {
    name: "Аксинья Белкина",
    status: "Студентка АМиУ, ДГТУ",
    text: "Благодаря TermCAT наша команда студентов ДГТУ смогла как минимум удвоить производительность нашей работы. Автоматизация здорово помогла нашей издательской научной работе: трудно подсчитать время, которое мы сэкономили с командой на обмене файлов друг с другом.",
  },
  {
    name: "Василиса Молоднякова",
    status: "Фрилансер",
    text: "На бирже фриланса много способов заработать в декрете, переводя инструкции к различным товарам для продажи на маркетплейсах. Работая с TermCAT инструментом, теперь я уверена, что не подведу своих заказчиков, ведь сложные термины, которые часто встречаются в составах TermCAT отлично переводит!",
  }
]
